In [1]:
import csv
import pandas as pd
from postgresql_conn import engine

path = '../data/'

###<font color='blue'>demographic</font>

In [2]:
dem = pd.read_csv(path + 'demographic.dat')
demographic = dem[['SEQN', 'SDDSRVYR', 'RIAGENDR', 'RIDAGEYR', 'RIDAGEMN']]
demographic.columns = map(str.lower, demographic.columns)
demographic.head()

    seqn  sddsrvyr  riagendr  ridageyr  ridagemn
0  62161         7         1        22       NaN
1  62162         7         2         3       NaN
2  62163         7         1        14       NaN
3  62164         7         2        44       NaN
4  62165         7         2        14       NaN

In [3]:
demographic.to_sql('demographic', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>body measure</font>

In [4]:
bm = pd.read_csv(path + 'body_measure.dat')
body_measure = bm[['SEQN', 'BMXWT', 'BMIWT', 'BMIRECUM', 'BMXHEAD', 'BMXHT', 'BMXBMI', 'BMDBMIC', 'BMXLEG', 'BMXARML', 'BMXARMC', 'BMXWAIST', 'BMXSAD1', 'BMXSAD2', 'BMXSAD3', 'BMXSAD4']]
body_measure.columns = map(str.lower, body_measure.columns)
body_measure.head()
#len(body_measure)

,seqn,bmxwt,bmiwt,bmirecum,bmxhead,bmxht,bmxbmi,bmdbmic,bmxleg,bmxarml,bmxarmc,bmxwaist,bmxsad1,bmxsad2,bmxsad3,bmxsad4
0,62161,69.2,NaN,NaN,NaN,172.3,23.3,NaN,40.2,35.0,32.5,81.0,17.7,17.9,NaN,NaN
1,62162,12.7,NaN,NaN,NaN,94.7,14.2,2,NaN,18.5,16.6,45.4,NaN,NaN,NaN,NaN
2,62163,49.4,NaN,NaN,NaN,168.9,17.3,2,40.3,36.3,22.0,64.6,15.6,15.5,NaN,NaN
3,62164,67.2,NaN,NaN,NaN,170.1,23.2,NaN,40.5,37.2,29.3,80.1,18.3,18.5,NaN,NaN
4,62165,69.1,NaN,NaN,NaN,159.4,27.2,3,42.1,35.2,29.7,86.7,21.0,20.8,NaN,NaN

In [5]:
body_measure.to_sql('body_measure', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>current health status</font>

In [6]:
hs = pd.read_csv(path + 'current_health_status.dat')
current_health_status = hs[['SEQN', 'HSD010', 'HSQ470', 'HSQ480', 'HSQ490', 'HSQ496', 'HSAQUEX']]
current_health_status.columns = map(str.lower, current_health_status.columns)
current_health_status.head()
#len(current_health_status)

    seqn  hsd010  hsq470  hsq480  hsq490  hsq496  hsaquex
0  62161       3       0       0       0       0        2
1  62162     NaN     NaN     NaN     NaN     NaN        1
2  62163       3       0       0       0       2        2
3  62164     NaN     NaN     NaN     NaN     NaN        2
4  62165       4       5      15       0       3        2

In [7]:
current_health_status.to_sql('current_health_status', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>diet behavior</font>

In [8]:
diet = pd.read_csv(path + 'diet_behavior.dat')
diet_behavior = diet[['SEQN', 'DBQ700', 'DBQ197', 'DBQ223A', 'DBQ223B', 'DBQ223C', 'DBQ223D', 'DBQ223E', 'DBQ229', 'DBD895', 'DBD900', 'DBD905', 'DBD910']]
diet_behavior.columns = map(str.lower, diet_behavior.columns)
diet_behavior.head()
#len(diet_behavior)

,seqn,dbq700,dbq197,dbq223a,dbq223b,dbq223c,dbq223d,dbq223e,dbq229,dbd895,dbd900,dbd905,dbd910
0,62161,2,3,NaN,NaN,NaN,13,NaN,1,2,2,0,0
1,62162,NaN,3,10,NaN,NaN,NaN,NaN,NaN,0,NaN,0,1
2,62163,NaN,3,NaN,NaN,NaN,13,NaN,NaN,0,NaN,0,2
3,62164,1,0,NaN,NaN,NaN,NaN,NaN,2,3,0,0,0
4,62165,NaN,3,10,NaN,NaN,NaN,NaN,NaN,2,2,5,3

In [9]:
diet_behavior.to_sql('diet_behavior', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>physical activity</font>

In [10]:
phys = pd.read_csv(path + 'physical_activity.dat')
physical_activity = phys[['SEQN', 'PAQ706', 'PAQ605', 'PAQ610', 'PAD615', 'PAQ620', 'PAQ625', 'PAD630', 'PAQ635', 'PAQ640', 'PAD645', 'PAQ650', 'PAQ655', 'PAD660', 'PAQ665', 'PAQ670', 'PAD675', 'PAD680', 'PAQ710', 'PAQ715', 'PAAQUEX']]
physical_activity.columns = map(str.lower, physical_activity.columns)
physical_activity.head()
#len(physical_activity)

,seqn,paq706,paq605,paq610,pad615,paq620,paq625,pad630,paq635,paq640,...,paq650,paq655,pad660,paq665,paq670,pad675,pad680,paq710,paq715,paaquex
0,62161,NaN,2,NaN,NaN,2,NaN,NaN,2,NaN,...,2,NaN,NaN,2,NaN,NaN,300,3,3,1
1,62162,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,8,1
2,62163,NaN,2,NaN,NaN,2,NaN,NaN,1,6,...,2,NaN,NaN,2,NaN,NaN,720,2,3,2
3,62164,NaN,1,5,60,2,NaN,NaN,2,NaN,...,1,5,60,1,1,45,300,2,8,1
4,62165,NaN,2,NaN,NaN,2,NaN,NaN,1,7,...,1,2,25,1,2,25,600,5,2,2

In [11]:
physical_activity.to_sql('physical_activity', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>physical functioning</font>

In [12]:
physf = pd.read_csv(path + 'physical_functioning.dat')
physical_functioning = physf[['SEQN', 'PFQ063A', 'PFQ063B', 'PFQ063C', 'PFQ063D', 'PFQ063E']]
physical_functioning.columns = map(str.lower, physical_functioning.columns)
physical_functioning.head()
#len(physical_functioning)

    seqn  pfq063a  pfq063b  pfq063c  pfq063d  pfq063e
0  62161       28      NaN      NaN      NaN      NaN
1  62163      NaN      NaN      NaN      NaN      NaN
2  62164      NaN      NaN      NaN      NaN      NaN
3  62165      NaN      NaN      NaN      NaN      NaN
4  62166      NaN      NaN      NaN      NaN      NaN

In [13]:
physical_functioning.to_sql('physical_functioning', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>diabetes</font>

In [14]:
diab = pd.read_csv(path + 'diabetes.dat')
diabetes = diab[['SEQN', 'DIQ010', 'DID040', 'DIQ170', 'DIQ172', 'DIQ175A', 'DIQ175B', 'DIQ175D', 'DIQ175G', 'DIQ175I', 'DIQ175K', 'DIQ175V']]
diabetes.columns = map(str.lower, diabetes.columns)
diabetes.head()
#len(diabetes)

,seqn,diq010,did040,diq170,diq172,diq175a,diq175b,diq175d,diq175g,diq175i,diq175k,diq175v
0,62161,2,NaN,2,1,10,NaN,NaN,NaN,NaN,NaN,NaN
1,62162,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,62163,2,NaN,2,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,62164,2,NaN,2,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,62165,2,NaN,2,1,10,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
diabetes.to_sql('diabetes', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>medical_condition</font>

In [16]:
medcon = pd.read_csv(path + 'medical_condition.dat')
medical_condition = medcon[['SEQN', 'MCQ080', 'MCQ086', 'MCQ300C', 'MCQ370A', 'MCQ370B', 'MCQ370C', 'MCQ370D']]
medical_condition.columns = map(str.lower, medical_condition.columns)
medical_condition.head()
#len(medical_condition)

    seqn  mcq080  mcq086  mcq300c  mcq370a  mcq370b  mcq370c  mcq370d
0  62161       2       2        1        1        1        2        2
1  62162     NaN     NaN      NaN      NaN      NaN      NaN      NaN
2  62163     NaN       2      NaN      NaN      NaN      NaN      NaN
3  62164       2       2        2        1        1        2        1
4  62165     NaN       2      NaN      NaN      NaN      NaN      NaN

In [17]:
medical_condition.to_sql('medical_condition', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>alcohol_use</font>

In [19]:
alc = pd.read_csv(path + 'alcohol_use.dat')
alcohol_use = alc[['SEQN', 'ALQ120Q', 'ALQ120U', 'ALQ130', 'ALQ141Q', 'ALQ141U']]
alcohol_use.columns = map(str.lower, alcohol_use.columns)
alcohol_use.head()

    seqn  alq120q  alq120u  alq130  alq141q  alq141u
0  62161      NaN      NaN     NaN      NaN      NaN
1  62164      NaN      NaN     NaN      NaN      NaN
2  62169        1        2       2        1        3
3  62172        2        1       3        1        1
4  62174        0      NaN     NaN      NaN      NaN

In [20]:
alcohol_use.to_sql('alcohol_use', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>consumer_behavior</font>

In [23]:
cons = pd.read_csv(path + 'consumer_behavior.dat')
consumer_behavior = cons[['SEQN', 'CBD070', 'CBD110', 'CBD120', 'CBD130']]
consumer_behavior.columns = map(str.lower, consumer_behavior.columns)
consumer_behavior.head()

    seqn  cbd070  cbd110  cbd120  cbd130
0  62161     250       0  999999       0
1  62162     300       0      50       0
2  62163     500      93      75       0
3  62164     500       0     100       0
4  62165     450       0      30       0

In [24]:
consumer_behavior.to_sql('consumer_behavior', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>dietary</font>

In [58]:
di = pd.read_csv(path + 'dietary_individual_day_1.dat')
dietary = di[['SEQN', 'DRDINT', 'DR1CCMNM', 'DR1CCMTX', 'DR1FS', 'DR1_040Z', 'DR1IFDCD', 'DR1IPROT', 'DR1ICARB', 'DR1ISUGR', 'DR1IFIBE', 'DR1ITFAT', 'DR1ICHOL', 'DR1ISFAT', 'DR1IMFAT', 'DR1IPFAT', 'DR1ISODI', 'DR1ICAFF', 'DR1IALCO', 'DR1IVD', 'DR1IPOTA']]
dietary.columns = map(str.lower, dietary.columns)
dietary.head()

,seqn,drdint,dr1ccmnm,dr1ccmtx,dr1fs,dr1_040z,dr1ifdcd,dr1iprot,dr1icarb,dr1isugr,...,dr1itfat,dr1ichol,dr1isfat,dr1imfat,dr1ipfat,dr1isodi,dr1icaff,dr1ialco,dr1ivd,dr1ipota
0,62161,2,0,0,NaN,1,94000100,0.00,0.00,0.00,...,0.00,0,0.000,0.000,0.000,57,0,0,0.0,0
1,62161,2,5,90,1,1,58131510,17.82,42.43,0.52,...,13.98,191,7.524,4.334,1.203,1342,0,0,0.9,169
2,62161,2,5,90,1,1,81102000,0.04,0.01,0.00,...,4.16,0,0.712,1.520,1.644,50,0,0,0.1,2
3,62161,2,0,0,1,1,64104010,0.45,50.79,43.24,...,0.58,0,0.099,0.027,0.175,18,0,0,0.0,454
4,62161,2,0,0,1,2,53712100,4.34,27.69,12.29,...,8.51,0,1.019,1.883,5.182,126,0,0,0.0,144

In [59]:
dietary.to_sql('dietary', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>mental_health</font>

In [33]:
men = pd.read_csv(path + 'mental_health_depression.dat')
mental_health = men[['SEQN', 'DPQ030']]
mental_health.columns = map(str.lower, mental_health.columns)
mental_health.head()

    seqn  dpq030
0  62161       0
1  62164     NaN
2  62169       1
3  62172       1
4  62174       0

In [34]:
mental_health.to_sql('mental_health', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>muscle_strength</font>

In [36]:
mus = pd.read_csv(path + 'muscle_strength_grip.dat')
muscle_strength = mus[['SEQN', 'MGXH1T1', 'MGXH1T2', 'MGXH1T3', 'MGDCGSZ']]
muscle_strength.columns = map(str.lower, muscle_strength.columns)
muscle_strength.head()

    seqn  mgxh1t1  mgxh1t2  mgxh1t3  mgdcgsz
0  62161     31.4     31.7     34.4     69.3
1  62163     34.3     36.5     27.1     71.0
2  62164     32.5     35.4     37.5     75.8
3  62165     20.1     22.2     24.9     50.5
4  62166     12.3     11.2     12.8     28.3

In [37]:
muscle_strength.to_sql('muscle_strength', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>sleep_disorder</font>

In [40]:
slp = pd.read_csv(path + 'sleep_disorders.dat')
sleep_disorder = slp[['SEQN', 'SLD010H', 'SLQ050']]
sleep_disorder.columns = map(str.lower, sleep_disorder.columns)
sleep_disorder.head()

    seqn  sld010h  slq050
0  62161        8       2
1  62164        8       1
2  62169        8       2
3  62172        8       2
4  62174        9       2

In [39]:
sleep_disorder.to_sql('sleep_disorder', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>smoking_cigarette</font>

In [43]:
smoke = pd.read_csv(path + 'smoking_cigarette_use.dat')
smoking_cigarette = smoke[['SEQN', 'SMQ020', 'SMD641', 'SMD650']]
smoking_cigarette.columns = map(str.lower, smoking_cigarette.columns)
smoking_cigarette.head()

    seqn  smq020  smd641  smd650
0  62161       2     NaN     NaN
1  62163     NaN     NaN     NaN
2  62164       2     NaN     NaN
3  62165     NaN     NaN     NaN
4  62169       2     NaN     NaN

In [44]:
smoking_cigarette.to_sql('smoking_cigarette', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>weight_history</font>

In [46]:
wght = pd.read_csv(path + 'weight_history.dat')
weight_history = wght[['SEQN', 'WHD010', 'WHD020', 'WHQ070', 'WHD080A', 'WHD080B', 'WHD080C', 'WHD080D', 'WHD080E', 'WHD080F', 'WHD080G', 'WHD080H', 'WHD080I', 'WHD080J', 'WHD080K', 'WHD080M', 'WHD080N', 'WHD080O', 'WHD080P', 'WHD080Q', 'WHD080R', 'WHD080S', 'WHD080T', 'WHD080L']]
weight_history.columns = map(str.lower, weight_history.columns)
weight_history.head()

,seqn,whd010,whd020,whq070,whd080a,whd080b,whd080c,whd080d,whd080e,whd080f,...,whd080k,whd080m,whd080n,whd080o,whd080p,whd080q,whd080r,whd080s,whd080t,whd080l
0,62161,68,150,NaN,10,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,62164,66,139,NaN,10,11,12,13,NaN,NaN,...,NaN,34,NaN,41,NaN,43,NaN,NaN,NaN,NaN
2,62169,64,120,2,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,62172,67,203,1,10,NaN,12,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,62174,68,211,1,10,NaN,12,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
weight_history.to_sql('weight_history', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>blood_pressure</font>

In [48]:
bp = pd.read_csv(path + 'blood_pressure_cholesterol.dat')
blood_pressure = bp[['SEQN', 'BPQ020']]
blood_pressure.columns = map(str.lower, blood_pressure.columns)
blood_pressure.head()

    seqn  bpq020
0  62161       2
1  62164       2
2  62169       2
3  62172       2
4  62174       1

In [49]:
blood_pressure.to_sql('blood_pressure', engine, index=False, if_exists='append', chunksize=1000)

###<font color='blue'>tobacco</font>

In [52]:
tob = pd.read_csv(path + 'tobacco.dat')
tobacco = tob[['SEQN', 'SMQ680']]
tobacco.columns = map(str.lower, tobacco.columns)
tobacco.head()

    seqn  smq680
0  62161       2
1  62163       2
2  62164     NaN
3  62165       2
4  62169       2

In [53]:
tobacco.to_sql('tobacco', engine, index=False, if_exists='append', chunksize=1000)